[
    {
      "itemID": "whereToDo",
      "itemName": "WhereToDo",
      "itemTagline": "A to-do list app that geolocates tasks.",
      "itemDescription": {
        "liveDemo": "https://wheretodolist.herokuapp.com/",
        "srcCode": "https://github.com/stefanhk31/geo-todo-list/tree/prod",
        "project": "WhereToDo is a location-based todo list. Users enter a task, location, and address, and a pin pops up on the map marking that particular task location. If there are multiple tasks in the same location, they will be combined into the same list. Users can then filter which lists appear on the map based on location name or distance from their current position.",
        "tech": "The app is built with React, using create-react-app. The map and distance filter come from Mapbox, and geolocation relies on HERE. Using these services was a great opportunity for me to learn how to build API services into my apps.",
        "future": "There are a few UI additions that would improve WhereToDo, including descriptive popups for the map pins, and a collapsible list panel for mobile. Functionally, I would like to add backend data storage, to allow users to store lists when they navigate away from the page. I’d also like to make WhereToDo into a Native app, in order to provide better mobile performance."
      },
      "itemImageDesktop": "assets/img/wheretodo_desktop.png",
      "itemImageMobile": "assets/img/wheretodo_mobile.png"
    },
    {
      "itemID": "sitStandTimer",
      "itemName": "Sit/Stand Timer",
      "itemTagline": "A timer app used to remind you to change position while working.",
      "itemDescription": {
        "liveDemo": "",
        "srcCode": "",
        "project": "I'm Brian, and so's my wife! Listen, strange women lyin' in ponds distributin' swords is no basis for a system of government. Supreme executive power derives from a mandate from the masses, not from some farcical aquatic ceremony. Are you suggesting coconuts migrate? What is the capital of Assyria? You don't frighten us, English pig dogs. Go and boil your bottoms, you sons of a silly person. I blow my nose at you, so-called 'Arthur King,' you and all your silly English K-nig-hts.",
        "tech": "Oh, king eh? Very nice. And how'd you get that, eh? By exploiting the workers. By hanging on to outdated imperialist dogma which perpetuates the economic and social differences in our society. The Lady of the Lake, her arm clad in the purest shimmering samite held aloft Excalibur from the bosom of the water, signifying by divine providence that I, Arthur, was to carry Excalibur. THAT is why I am your king.",
        "future": "Listen, strange women lyin' in ponds distributin' swords is no basis for a system of government. Supreme executive power derives from a mandate from the masses, not from some farcical aquatic ceremony. You don't frighten us, English pig dogs. Go and boil your bottoms, you sons of a silly person. I blow my nose at you, so-called 'Arthur King,' you and all your silly English K-nig-hts "
      },
      "itemImageDesktop": "assets/img/sitstandtimer_desktop.png",
      "itemImageMobile": "assets/img/sitstandtimer_mobile.png"
    }
  ]