[
    {
      "itemID": "whereToDo",
      "itemName": "WhereToDo",
      "itemTagline": "A to-do list app that geolocates tasks.",
      "itemDescription": {
        "project": "Oh, king eh? Very nice. And how'd you get that, eh? By exploiting the workers. By hanging on to outdated imperialist dogma which perpetuates the economic and social differences in our society. Nobody expects the Spanish Inquisition!",
        "tech": "The Lady of the Lake, her arm clad in the purest shimmering samite held aloft Excalibur from the bosom of the water, signifying by divine providence that I, Arthur, was to carry Excalibur. THAT is why I am your king. Manacles! Ooooh, my idea of heaven, is to be allowed to be put in manacles. Just for a few hours. They must think the sun shines out your ass, sonny.",
        "future": "I don't want to talk to you no more, you empty-headed animal food trough wiper! I fart in your general direction! Your mother was a hamster and your father smelt of elderberries! Are you suggesting coconuts migrate? I'm Brian, and so's my wife! Oh, oh, I see! Running away, eh? You yellow bastards! Come back here and take what's coming to you! I'll bite your legs off! What is the capital of Assyria? Come and see the violence inherent in the system. Help! Help! I'm being repressed!"
      },
      "itemImage": "This will be an image URL."
    },
    {
      "itemID": "sitStandTimer",
      "itemName": "Sit/Stand Timer",
      "itemTagline": "A timer app used to remind you to change position while working.",
      "itemDescription": {
        "project": "I'm Brian, and so's my wife! Listen, strange women lyin' in ponds distributin' swords is no basis for a system of government. Supreme executive power derives from a mandate from the masses, not from some farcical aquatic ceremony. Are you suggesting coconuts migrate? What is the capital of Assyria? You don't frighten us, English pig dogs. Go and boil your bottoms, you sons of a silly person. I blow my nose at you, so-called 'Arthur King,' you and all your silly English K-nig-hts.",
        "tech": "Oh, king eh? Very nice. And how'd you get that, eh? By exploiting the workers. By hanging on to outdated imperialist dogma which perpetuates the economic and social differences in our society. The Lady of the Lake, her arm clad in the purest shimmering samite held aloft Excalibur from the bosom of the water, signifying by divine providence that I, Arthur, was to carry Excalibur. THAT is why I am your king.",
        "future": "Listen, strange women lyin' in ponds distributin' swords is no basis for a system of government. Supreme executive power derives from a mandate from the masses, not from some farcical aquatic ceremony. You don't frighten us, English pig dogs. Go and boil your bottoms, you sons of a silly person. I blow my nose at you, so-called 'Arthur King,' you and all your silly English K-nig-hts "
      },
      "itemImage": "This will be an image URL."
    }
  ]